{

"Udokumenterede_projekter": {
  "title": "Udokumenterede projekter",
  "image": "https://tse4.mm.bing.net/th/id/OIP.1PH9m5E_T9guOvEqicK1GwHaHT?rs=1&pid=ImgDetMain&o=7&rm=3",
  "sub_description": "Dette er procjekter der ikke er dokumenteret endnu. eller procjekter der ikke er færdige.",
  "description": "Nogle projekter er endnu ikke dokumenteret eller befinder sig i en ufuldstændig tilstand. Her er en liste over disse projekter. Derudover findes der tidligere projekter, hvor dokumentationen er gået tabt, og som derfor ikke kan vises i deres fulde form.",
  "topics": [],
  "topicsSummery": [],
  "category": [],
  "date": "",
  "link": "Udokumenterede"
},

"MilWeb": {
  "title": "MilWeb",
  "image": "https://i.pinimg.com/736x/9f/ab/96/9fab9693c09373298cbb7123a704aba4.jpg",
  "sub_description": "Et militært koordineringssystem til visualisering og håndtering af troppebevægelser.",
  "description": "MilWeb er et afsluttende 3.g eksamensprojekt i informatik, hvor vi udviklede et webbaseret militærsystem til generaler og soldater. Systemet gør det muligt at visualisere troppepositioner i realtid, sende missioner og beskeder, samt sikre data med moderne kryptering. Projektet inkluderer frontend, backend, database og sikkerhed – og er skabt med fokus på både teknisk kompleksitet og brugervenlighed.",
  "topics": ["Node.js", "Express", "Leaflet.js", "MySQL", "HTML/CSS", "JavaScript"],
  "topicsSummery": ["Sikkerhed", "UI/UX", "Rollebaseret adgang", "Responsivt Design"],
  "category": ["Web", "Fullstack", "Backend", "Frontend", "Database", "Sikkerhed"],
  "date": "May 2025",
  "link": "MilWeb"
},
"BT_Sound_System":{"title": "BT Sound System",
    "image": "https://i.pinimg.com/736x/bf/ac/f6/bfacf6f39d514b822a9e5277c2aa48e9.jpg",
    "sub_description": "Et trådløst Bluetooth lydsystem til at eliminere kabler, kompatibelt med forskelige enheder.",
    "description": "Projektet omhandler udviklingen af et trådløst Bluetooth-musikanlæg designet til diskret montering under en seng. Det moderniserer et ældre analogt lydsystem ved at tilføje trådløs streamingkapabilitet, som gør det muligt at forbinde smartphones, tablets og computere uden brug af kabler, hvilket øger fleksibiliteten og brugervenligheden.",
    "topics": ["ESP32", "Bluetooth", "Embedded Systems", "Audio Amplifier", "3D Printing", "microcontroller"],
    "topicsSummery": ["Hardware Design", "IoT", "DIY Electronics"],
    "category": ["IoT", "Embedded_System"],
    "date": "May 2025",
    "link": "BT Sound System"
}

}